# DataFrame

In [1]:
import pandas as pd

In [2]:
d=pd.DataFrame()

In [3]:
type(d)

pandas.core.frame.DataFrame

In [4]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [5]:
data=[['a',2],['b',2],['c',3],['d',4]]

In [6]:
pd.DataFrame(data)

   0  1
0  a  2
1  b  2
2  c  3
3  d  4

In [7]:
#Changing the row name and column name
d1=pd.DataFrame(data,columns=['A','B'],index=['a','b','c','d'])

In [8]:
d1

   A  B
a  a  2
b  b  2
c  c  3
d  d  4

In [14]:
#dataframe using dictionary
d={'name':['a','b','c','d'],'age':[45,50,30,56]}

In [15]:
d

{'name': ['a', 'b', 'c', 'd'], 'age': [45, 50, 30, 56]}

In [26]:
a1=pd.DataFrame(d)
d

  candidate  age_year
0         a        45
1         b        50
2         c        30
3         d        56

In [27]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [47]:
d.rename({'name':'candidate','age':'age_year'},axis=0,inplace=True)
d

  candidate  age_year
0         a        45
1         b        50
2         c        30
3         d        56

In [49]:
c=d.rename({'candidate':'sejal','age_year':'jayesh'},axis=1,inplace=False)
c

  sejal  jayesh
0     a      45
1     b      50
2     c      30
3     d      56

# Accessing the elements from dataframe

In [50]:
data=[['Alex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],['Boris',14,'Englis'],['Ken',18,'Geo']]

In [51]:
data

[['Alex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Englis'],
 ['Ken', 18, 'Geo']]

In [53]:
data[2][0]

'Kelly'

In [54]:
data[3][2]='sej'

In [55]:
data

[['Alex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'sej'],
 ['Ken', 18, 'Geo']]

In [56]:
d=pd.DataFrame(data,columns=['Name','Age','Sub'])
d

    Name  Age      Sub
0   Alex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      sej
4    Ken   18      Geo

In [57]:
#Accessing one single column
d['Name']

0     Alex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Name, dtype: object

In [60]:
d[['Name','Sub']]
d

    Name  Age      Sub
0   Alex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      sej
4    Ken   18      Geo

In [61]:
d.iloc[3,1]

14

In [64]:
d.iloc[3,1]=20       #changing the element
d

    Name  Age      Sub
0   Alex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   20      sej
4    Ken   18      Geo

In [71]:
#adding the column name
d['Gender']='Male'
d

    Name  Age      Sub Gender
0   Alex   10    Maths   Male
1    Bob   12  Science   Male
2  Kelly   15      Eco   Male
3  Boris   20      sej   Male
4    Ken   18      Geo   Male

In [74]:
d['Age']=d['Age']+1
d

    Name  Age      Sub Gender
0   Alex   12    Maths   Male
1    Bob   14  Science   Male
2  Kelly   17      Eco   Male
3  Boris   22      sej   Male
4    Ken   20      Geo   Male

In [95]:
d.iloc[:,[0,1]]

    Name  Age
0   Alex   12
1    Bob   14
2  Kelly   17
3  Boris   22
4    Ken   20

In [79]:
d.iloc[:2,1:3]

   Age      Sub
0   12    Maths
1   14  Science

In [85]:
d.iloc[1:3,[0,1]]

    Name  Age
1    Bob   14
2  Kelly   17

In [86]:
d.iloc[[1,2],[2,3]]

       Sub Gender
1  Science   Male
2      Eco   Male

In [90]:
d.iloc[[1,3],2:3]

       Sub
1  Science
3      sej

In [92]:
d.iloc[0,0]

'Alex'

In [96]:
d.iloc[1]

Name          Bob
Age            14
Sub       Science
Gender       Male
Name: 1, dtype: object

In [99]:
d.loc[:2,['Name','Sub']]

    Name      Sub
0   Alex    Maths
1    Bob  Science
2  Kelly      Eco

In [104]:
d.loc[::-1]

    Name  Age      Sub Gender
4    Ken   20      Geo   Male
3  Boris   22      sej   Male
2  Kelly   17      Eco   Male
1    Bob   14  Science   Male
0   Alex   12    Maths   Male

In [106]:
d.iloc[:,[3,2,1,0]]

  Gender      Sub  Age   Name
0   Male    Maths   12   Alex
1   Male  Science   14    Bob
2   Male      Eco   17  Kelly
3   Male      sej   22  Boris
4   Male      Geo   20    Ken

In [109]:
d.iloc[1:3,1]=[40,50]
d

    Name  Age      Sub Gender
0   Alex   12    Maths   Male
1    Bob   40  Science   Male
2  Kelly   50      Eco   Male
3  Boris   22      sej   Male
4    Ken   20      Geo   Male

In [110]:
d['Sub']

0      Maths
1    Science
2        Eco
3        sej
4        Geo
Name: Sub, dtype: object

In [112]:
d.loc[3]

Name      Boris
Age          22
Sub         sej
Gender     Male
Name: 3, dtype: object